// 百度提前批二面编程题
//
// 经典区间问题
//
// 先判断水平方向是否重叠，再判断竖直方向是否重叠。

// 这个例子中，两矩形水平方向重叠，但是竖直方向不重叠。
//
// [5,15,8,18]
// [0,3,7,9]
//
// ^
// |
// |    ****
// |    *  *
// |    *  *
// |    ****
// |
// |
// |
// |
// |
// ********
// *      *
// *      *
// *      *
// *      *
// *      *
// ********
// |
// |
// +----------------------------------->
class Solution {
public:
    bool isRectangleOverlap(vector<int>& rec1, vector<int>& rec2) {
      // 水平是否重叠？
      if (rec1[2] <= rec2[0] || rec2[2] <= rec1[0]) {
        return false;
      }
      // 竖直是否重叠？
      if (rec1[3] <= rec2[1] || rec2[3] <= rec1[1]) {
        return false;
      }
      return true;
    }
};
